"use client";
import { useState } from "react";
import "./ascii_avatar.css";

export default function Acii_avatar({
    control = true,
    size,
}: {
    control: boolean;
    size: number;
}) {
    const [scale, setScale] = useState(size);

    const scaleAvatar = (x: string) => {
        let value = Number(x);
        setScale(value);
    };
    return (
        <div id="ascii_avatar">
            <pre
                style={{
                    fontSize: "4px",
                    // fontWeight: 100,
                    lineHeight: "5px",
                    letterSpacing: "2px",
                    marginRight: "-100px",
                    transform: `scale(${scale},${scale})`,
                }}
            >{`
                                        Xêg       qœœŽŽÀ                    âéÚð  
                                     ŽŽŽERgÐ     êÐŽgKHHXé                 mÔâÔé 
                               Ðqqœ   ŽœXXŽ        gXR€ßRÐß    ðÜé        pp€pG         G   
                              HœRHŽœRRŽRÀRgÐXÐggœXÐHXÔ¶éãêðÚ  éé$GG€ãë Úè$ßqÛm        ðã           
                             œRÄKKÀÄÄRœKKRÐœœXKRŽœœŽKRŠŠøGm€A¶Ú8ÚGmøøG¶ã¶G€êA¶ð€¶mã  ðG               
                    HŽXg XXXŽœKŽÀÄHÁÄRHÄRXXHKŽœKHÄEK ÀHÀœXRKHKg€ßãqÔ¶ÚGâqRÔpêÐßm€êêâGðð ëøðøðã      ßA8                
                   gRÀÁÀÄEÀKHRÀKÀHHKHRÀHŽX ggŽêqgRÐgœXœXœHŽRKœgŠÕqgÔøð¶pqŠXŠmmâßø¶ãpÛêÕÕpããâ      ÚßÕÔpqÕß            
                   ŽRœKRŽŽRŽÐKHÀÄþÀHRXqœœÐXÐXœŽŽ   œ Ð   œœXHÐÕmÔÕŠŠðøpÕgÐÕAéGâGÕÐgŠêÐXgÔÕÔAâdý  dâêgŽgÛÐÛãâ         
                  HRKŽêŽRXêgêœKEÁþþþKœg        D     d$dë   ã¶ßë¶Õéððßø¶ŠqÔâãâépqÛgXXœœêêA¶âAp€âÜ$éAßGAêÔãêÕ$         
                  ŽœŽgêÐ   €ÐXœHEþþþNRg      ¥bÒ¥Ó  éÓdÙ ÓÓ àÖGýÚýÜèmÛßÔêÛ€qßŠÔp¶é¶ÛãGmqRÐœÐRÐÜÙëŠâmÐŽŽÛÛŠßq€         
               HŽKEÀXgX œg  XRKHÀÀHRŽggÛ      bPÒÞÒáZÖÒñbýýÞPÖÒ8ýšb€ÛÛmßâAGmøÛœqmÚÜÕRŽgŽÄKœgßé  é8GqŽXŽÀÀŽßÛøÚ       
               KRÁEHH  œRK  XRŽRKgÐXÛ        ÒäPÒ å¥¥FÇš FÒZÇPFÞëëGÔ€ßßgXKRqßpÐHŽgœÐgŽKŽÀœgÐpAßAâøã€ÕApAŽŽêXXAø        
               ÄRNRRKBHgRKHÀÀRgXÐ                              ¥P¥¥   ÛqÐŽŽXmÜÛœŽqÕÕÛŠÐŽœRÄEÄÀHœÛŠÐKœßmßÔœÐpGø           
                ÀRRRRÀH ŽHKŽKKêÛ         «   ˆ‚˜   ‘ˆˆ˜’’;’’‚‚˜‚’º°      mêÕøGëAKÄŽÕ  RXÐœÄþþþÄHRÛêqÛÐßÐÀÐßGâø          
               RKêœXŽXXœŽœŽXg     ª“º°‚˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’˜˜’¹„«âÛŠGGŠKŽŠêpAqqÀþþÀÄHÄKRÐHEÀRRKœm           
              œÀHRg qqÐœgK     —~³’’˜ˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜˜’‚:“¦ 8 ßqRœêÔŠêRÄÀþÄHÄþÀKXgŽÐXp¶¶8        
             œEHKœêgŽgêXœŽŽÀ ”²‘’’’˜ˆˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’’‚‘~«  êœœRÐÐÛœKÀHREÄHXggÔÔÔAÛêA      
            ŽÄŽHŽ  ŽÄEŽŽ   ¯³’‘‚’’˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’˜˜˜’‚›^   qêgKHgXKEERœRRKRœRœqÕããâ      
          XRHÀKŽœŽœÀHŽÐ   ÷–‘‘‚’’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’‚‘‘;º¦  ÐÐœêgŽHHÀRŽHEEKKŽœÐÔßêø    ëëé    
          œKþKKHRÄÀœœg   •ª›‚’˜˜’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’‚’‚‘¹ª÷gÛœXgœKEHXÀHEþþÀEHÐqXÐßéðø ¶ëëÚ      
         ÐÐœÀÄ   ÄÁHgŽ   !„;‚˜’˜’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜’‚‚‘;^  ÕXÐqgŽEEÀÀKHEEEEÄKœRŠÚ$Ùýd$é8       
         gqXÀEEEEÄRœêÐ   •º’‚‚˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’’‘º÷  ŠœRœŽŽÀHKÀþEþþEÄÄŽgŠ€âÕÚGGÚÚ      
          RKEþþEÁþÄÀK   ””­:‚’’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’’‘¹÷¬  €ÐKÐÕêKÐŽHÀÄEEEHÀÀRÕß ¶øéÜÜ     
          ÀÄ       Hœ   ¡„¹‘’’˜ˆˆˆ¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’‘‘;º^  ÛqêKŽKÄEÄHHÄþþþþEKXAâpéðÚ$Ù    
          RŽ   EEEEÀR   ^–;’‘˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’‚‘:­¯» ÔÔgqœHÀÄÄÄEKÄþEHÀEHq€ãpâG     
           XŽ    EEKŽ   “;‘‘‘‚˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’‚‘‘’›º¦  ÐXœŽXgKþEÀHKKÄHRHKÛãø8é     
           XRÄ   KÄRœ   “›’‘‘’’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’‚‚‚‚:°ª  pAXKÀÀÄþþþþþþÄHÄEHÛ¶ÙdÜðð   
             K   KKRœÀ ¡„­’‘˜‚‚‚’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’ª~;‘‚‘’‹º¬  ÐRKœRHþþEEEÄÄEEERÔø$   
              À ÀHŽHRŽ ^³‹’‘‘²—“~’˜ˆˆˆ˜˜:¸¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’’–”ª”~¡«[/{×?{*{¬”;›‹–¡‰AŠÔŽœœHþþEEþþþþEHÀqâ    
             þXŽÀHHÀKŽ ¡“­­“(†*)*{(+r1ƒsòs¢uu<)­ˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’²+=óY©22£n¤líc1jîJI /–­­—íÐggXHEþEþþþþþÀþœÛÔÙ        
             œÐ KRKKKŽœ¦””!j½¢uö‰v<¿¬c>lïvcz¼¤×¡‚˜ˆˆˆˆˆˆˆˆˆˆˆˆ;„÷>11‡îí¦‘›°~­­¹”¯«ìï7¡º”“µXKKXHEEÄEþþKÄEEgß     
                 KRKŽŽ ¬—|}ït>}÷¹‘ˆˆ¸ˆˆˆˆˆ‘‚­„^—³‘’ˆˆˆˆˆˆˆˆˆ˜‚¹~ª~°³›¸ˆˆˆˆˆˆˆˆ’ ‚°„!»|”“„¬œêXŽŽÄÄEþÄÀÄþKêé$Ù$    
                  ŽHœœÿ¬¦(*¿«—²‹  ˆˆˆˆˆˆˆ’‘‚’‘‘‘‘’’’ˆˆˆˆˆˆˆˆ˜­ººº~“””‘  ‚˜ ‚:‚ ‹›‹¹³¯|÷~~¡ ÐêœÄÄœRHÀHRXp8$$     
                   RRŽ»—^•/|~²­›³¡„  2     ‚‚›°¹¹:‘‚ˆˆˆˆˆˆˆˆ‘²“¡“°‘‘ cç¬vç0£@¡¯«ª~°~„^³¹°~¯  ÛÛ¶ÐEEHKgAd8      
                   œœR¯~¹²²¹¹–—tJr†’ˆùL¦­27ˆˆ…›’’’’˜ˆˆˆˆˆˆˆˆ‚’˜‚~^ˆ¸˜=îuõ6™ˆˆj@Ï¼*^­››::‘;IÒÒÓñ ÔRÄHŽÐ       
                     «“­’‘‚‚:º„Iojªˆˆ­02ô©ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆˆˆˆ’˜ §k ˆˆˆ’•7+”­‘‚˜’‚’›s¥ÞbåéqRÀœ      
                     «^¹‚’˜˜’’;³ª ²˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’›­››‘‚˜ˆˆˆ’‚‹}äÖá œŽXgŠ       
                     ¯³›’˜ˆˆˆ˜’’’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ   ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜;~¥à  +•ŠÕ       
               !¬|>¼ ¬²›‚˜ˆˆˆˆˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆ  ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’’–^     «        
               ÷¦¦vcƒ|ª²‚˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜:²„ °^»!“       
                ³^~“  ¬”¹’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’ª—º°º°²’     
                 ²”­³ (!~‚ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’–¯„››:;‘’       
                  ²²º„{¬ªº’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜‘~ªª­­˜‚       
                   ¹­¹|¬^~‘˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’›“÷“;‘‚       
                    :˜²/—~›‚˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’‚˜ˆˆˆˆˆˆˆˆ˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’‚‹°º¯º’‘‘       
                     ¸¸{|~°’’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’¹¡¡³‘’’’’’;²•z!°˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜:–ª”‘‘›       
                     •¯•«^‹’’’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜¦/+{÷~~¯•«•»l7÷³ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’‹³¦”;’       
                      |”(¡­‚’’˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ‘­‚’¹„«!)^²„^¡^‚ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’¹“ª°‘:     
                      ’’¡÷^’’’˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’˜ˆˆˆˆˆˆˆˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜˜’‘ºª„;’      
                      ’’^!^²’˜˜ˆ˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’;²³²’‚¹   
                      ’;³!—“’’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’‚›‹–„’:×c   
                       »»¬^”~;˜˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’‚‘‘º| ’ic      
                         •—“–›‚’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’’¹”    ƒI     
                         }»”º­‚‚’’˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’‹­›’ˆˆ’°“ªª³›˜ˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜’’’:­³        
                          }¡“³¹‚’’’‚’˜ˆˆˆˆˆˆˆˆˆ’°¡«!¡•/¿×}+i??×}¿(«^‘ˆˆˆˆˆˆˆˆˆ˜˜ˆ˜˜’‘­“!          
                           »¯~–›’’‚‚’˜ˆˆˆˆˆˆ˜’    ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’˜’˜ˆˆˆˆˆˆ˜˜˜ˆ˜’’:²^         
                            «¦”­;‚‚‚‚˜˜ˆˆˆˆˆ˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜ˆˆˆˆˆˆˆˆ˜’‘‚’‚:²^{        
                            {/¦”–‹:‘‚’’˜ˆˆˆˆˆˆˆ˜’˜˜ˆˆˆ¸ˆˆ˜’‘¹­:˜ˆ’’’˜ˆˆˆˆˆ˜˜’‚‘‚’‘‹²^•         
                             *(÷^~°­‹‚’˜˜ˆˆˆˆˆˆˆˆˆ˜˜’’‹•~°’ˆˆ˜ˆˆˆˆˆ˜’˜’˜ˆˆˆ˜‚‘‘‚‘;°¡)          
                               ?¬„º°¹›‘‚’˜ˆˆˆ˜˜’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’˜’’˜ˆˆ˜’‚‘’‘’²¯)        
                                i+¯~²¹;‚’˜˜˜ˆˆˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’˜˜ˆ˜’’’‹‘:–¦}           
                                 ¿»^~°‹:’˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜’’››–¯}[        
                                ¤vï{÷^³–:’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’¹–²~¡†/|        
                                ì?>ì?)|÷”‹‚’˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜’:º„!•×?»¦¡       
                                ì)»)[ï>}!—°¹;‚˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜‚‘›ºª¦/+×i+÷””(   
                                 /÷^¬¿<>¿[*¡ª³–‚’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’:°‹³÷}*({×»—~~^»         
                                 /ªº”÷»¿†7[?/¯„~–¹›’˜ˆˆˆˆˆˆˆˆˆˆˆ˜‚–~³¦+†7¿}*¿/“³²­„¬        
                                 «”¹¹°„!}7ììlr=}«•«»¡“››˜’’˜’;²—¡+{[ïr1[×¿¿})ª­‹²¹²¡      
                                 ¬“›’‚’°^•iïvvr1lcrtlllíï>í=vl=  ttî1ìi†¿{(|~­;:’:›”          
                                 «ª›‚‚‚‚‘’²—{ì=îj1r¤IjvjIo%Jt¤ƒƒîjvvìi?+»|”²;‚’’’‚‹³„                 
                                [|„:‚’’’˜˜‚‚›²¯)?=ìlîcvcvoccîvcjvï7?}+/¦~­:’˜˜˜˜’:’°„            
                              «|!|ª;’˜˜˜ˆˆˆˆ˜‚‘›³^¡»/*}}>¿×[7[(»/×|¦ª“­‚‚˜˜ˆˆˆˆˆˆˆˆˆˆˆ’’‚;›²³          
                          „„^¯¯^¯„–‘‘’˜˜ˆˆˆˆˆˆˆ’‚‚:²~“„„^^—„¯^„”³­º°:‘’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’‚‚­²“”–       
                        ³²°°–“³º“³‹‘‘’˜˜ˆˆˆˆˆˆˆˆˆˆ˜˜’’’’‚‘‚‚’’‚‚‘‚’’˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’’’:‹°­¹¹­­       
                    ª­‹’’‘;’‹¹­­º–‘‘’‚˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜’’‚’;’‚’’’˜      
                ‚’‘‚‚‚‚’‘‘‚‘‘‘¹­›‘‚’’˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜’’‚‚‚’˜˜˜˜ˆ…   
             ˆ˜˜˜˜˜˜’’‚’’‚‚‚‚‘’‘‘’’˜ˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜ˆˆ˜˜˜’’’’˜˜ˆˆˆ˜  
             ¸ˆˆˆˆˆ¸ˆˆ˜’’‘‚‚‚‘‚‚‚˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜ˆˆˆ˜˜˜‘    
                ¨ˆˆˆˆˆ’’’‚’’’˜’’’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜‚    
                ‘…ˆˆ˜˜˜˜˜’’’’‚˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜   
                ˆˆˆ˜˜’’’˜ˆ˜˜’˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜˜˜’˜     
                 ˆˆ˜˜˜’’˜˜ˆ˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜˜’’˜‚      
                   ˆ˜˜’˜’’˜˜˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜˜˜˜’’’ˆ’   
                    …¸ˆ˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜’ 
                      :ˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆˆ…˜ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ        
                         ¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ’˜ˆˆ     
                           ˆ¸ˆˆˆˆˆˆ¸¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ˜ˆ        
                              ˆˆˆˆˆˆˆˆˆˆˆˆ¸¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸˜ˆˆˆˆˆˆˆˆ   
                                …ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆˆˆ         
                                    ’ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆˆˆˆˆˆˆˆ¸¸¸˜                  
                                         ¸˜¸ˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆˆ¸ˆˆˆˆ   ˆˆˆˆˆˆˆ¨              
                                              ˆ¸¸ˆˆˆˆˆˆˆˆ¸ˆˆˆˆˆˆˆˆˆˆ ˆˆˆ˜…                             `}</pre>
            {control && (
                <input
                    type="range"
                    onChange={({ target }) => scaleAvatar(target.value)}
                    step={0.01}
                    min={0.5}
                    max={5}
                    value={scale}
                    style={{ zIndex: 1 }}
                ></input>
            )}
        </div>
    );
}
